DataProcessors/ДМ_ЗаполнениеКодSAP_ВОрганизациях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ДМ_ЗаполнениеКодSAP_ВОрганизациях</Name>
			<Comment>Установка значения реквизита ДМ_КодSAP в справочнике Организации</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДМ_КодSAP</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ДМ_ЗаполнениеКодSAP_ВОрганизациях/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Объект.Организации.Очистить();
	лЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ДМ_КодSAP КАК ДМ_КодSAP,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|	И Организации.ДМ_КодSAP < ""0""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование"
	);
	лПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
	лРезультат = лЗапрос.Выполнить();
	Если лРезультат.Пустой() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( НСтр("ru = 'Нет организаций без кода SAP'") );
		Возврат;
	
	КонецЕсли;
	
	лВыборка = лРезультат.Выбрать();
	Пока лВыборка.Следующий() Цикл
		
		лНоваяСтрока = Неопределено;
		лНомерПланта = "";
		
		Если ПустаяСтрока(лВыборка.ДМ_КодSAP) Тогда
			лНаименование = СокрЛП(лВыборка.Наименование);
			лНомерПланта = Прав( лНаименование, 5 );
			лНомерПланта = СокрЛП(лНомерПланта);
			Если СтрДлина( лНомерПланта ) = 4 Тогда
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке( лНомерПланта ) Тогда
					лНоваяСтрока = Объект.Организации.Добавить();
					лНоваяСтрока.ДМ_КодSAP = лНомерПланта;
				Иначе
					лНомерПланта = "";
				КонецЕсли;
			Иначе
				лНомерПланта = "";
			КонецЕсли;
		Иначе
			лНомерПланта = лВыборка.ДМ_КодSAP;
		КонецЕсли;
		
		Если лНоваяСтрока <> Неопределено Тогда
			лНоваяСтрока.Обновлять = Истина;
			лНоваяСтрока.Организация = лВыборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.Организации.Количество() = 0 Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( НСтр("ru = 'Нет подходящих данных для заполнения'") );
		Возврат;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникОрганизацииНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого лСтрокаТЧ Из Объект.Организации Цикл
	
		Если Не лСтрокаТЧ.Обновлять Тогда
			Продолжить;
		КонецЕсли;
		
		лОрганизация = лСтрокаТЧ.Организация.ПолучитьОбъект();
		лОрганизация.Заблокировать();
		лОрганизация.ДМ_КодSAP = лСтрокаТЧ.ДМ_КодSAP;
		лОрганизация.Записать();
		лОрганизация.Разблокировать();
		
		лСтрокаТЧ.Обновлять = Ложь;
		лСтрокаТЧ.Выполнено = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникОрганизации(Команда)
	ОбновитьСправочникОрганизацииНаСервере();
КонецПроцедуры
